# Создать свой тип с помощью type.
Type = type('Type', (), {'name': 'Type', 'value': 500})
print(Type)
print(Type.name)
print(Type.value)
